<template>
	<div>
		<!-- HEAD -->
    <PartsModalsForzeModal />
		<section class="head personalArea-main">
			<div class="head-main">
				<div class="head-title">
					<div class="head-title-icon">
						<img src="~/assets/img/personalArea/icon2-red.png" alt="" />
					</div>
					<div class="head-title-content">
						<h1>Дневник АГ</h1>
						<p>Следите за своим давлением, добавляя в дневник свои результаты</p>
					</div>
					<p class="mobile">Следите за своим давлением, добавляя в дневник свои результаты</p>
				</div>
				<div class="btns-group">
					<a class="add-froze" href="#main__reminder">
						Добавить напоминание
						<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M22.0792 5.10969L18.8917 1.92219C18.8235 1.8469 18.7407 1.78626 18.6483 1.74394C18.556 1.70162 18.456 1.67851 18.3544 1.67601C18.2528 1.67351 18.1518 1.69167 18.0575 1.72939C17.9631 1.76711 17.8774 1.82361 17.8056 1.89545C17.7338 1.96729 17.6773 2.05298 17.6395 2.14732C17.6018 2.24166 17.5837 2.34267 17.5862 2.44424C17.5887 2.54581 17.6118 2.64581 17.6541 2.73818C17.6964 2.83054 17.7571 2.91335 17.8323 2.98157L21.0198 6.16907C21.1598 6.30694 21.3484 6.38436 21.5448 6.38469C21.744 6.38385 21.9353 6.30668 22.0792 6.16907C22.2195 6.02847 22.2983 5.83798 22.2983 5.63938C22.2983 5.44078 22.2195 5.25029 22.0792 5.10969Z" fill="#4065AE" />
							<path d="M6.16903 1.92215C6.02843 1.78189 5.83794 1.70312 5.63934 1.70313C5.44074 1.70312 5.25025 1.78189 5.10965 1.92215L1.92215 5.10965C1.78189 5.25025 1.70312 5.44074 1.70313 5.63934C1.70312 5.83794 1.78189 6.02843 1.92215 6.16903C2.06612 6.30664 2.25737 6.38381 2.45653 6.38465C2.65302 6.38432 2.84153 6.3069 2.98153 6.16903L6.16903 2.98153C6.30929 2.84093 6.38806 2.65044 6.38806 2.45184C6.38806 2.25324 6.30929 2.06275 6.16903 1.92215Z" fill="#4065AE" />
							<path d="M21 11.7379C20.9922 11.6726 20.9891 11.6068 20.9906 11.541V11.541C20.8776 9.31656 19.9438 7.21303 18.3697 5.6372C16.7956 4.06138 14.6931 3.12522 12.4688 3.00977H11.5312C9.30845 3.12502 7.20721 4.05986 5.63334 5.63373C4.05947 7.2076 3.12463 9.30884 3.00937 11.5316V11.5316C3.01092 11.5974 3.00779 11.6632 3 11.7285V12.2535C3.00779 12.3188 3.01092 12.3846 3.00937 12.4504V12.4504C3.12014 14.6765 4.05299 16.7823 5.6273 18.3601C7.20162 19.9379 9.30539 20.8754 11.5312 20.991H12.4688C14.6915 20.8758 16.7928 19.9409 18.3667 18.3671C19.9405 16.7932 20.8754 14.6919 20.9906 12.4691V12.4691C20.9891 12.4034 20.9922 12.3376 21 12.2723V11.7473V11.7379ZM17.25 12.7504H12C11.8011 12.7504 11.6103 12.6714 11.4697 12.5307C11.329 12.3901 11.25 12.1993 11.25 12.0004V6.75039C11.25 6.55148 11.329 6.36071 11.4697 6.22006C11.6103 6.07941 11.8011 6.00039 12 6.00039C12.1989 6.00039 12.3897 6.07941 12.5303 6.22006C12.671 6.36071 12.75 6.55148 12.75 6.75039V11.2504H17.25C17.4489 11.2504 17.6397 11.3294 17.7803 11.4701C17.921 11.6107 18 11.8015 18 12.0004C18 12.1993 17.921 12.3901 17.7803 12.5307C17.6397 12.6714 17.4489 12.7504 17.25 12.7504Z" fill="#4065AE" />
						</svg>
					</a>
					<button class="add-froze btn-add-forze" @click.prevent="$nuxt.$emit('open-modal', 'forze')">
						Добавить показатели АГ
						<svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M13.5 9C13.5 8.17157 14.1716 7.5 15 7.5C15.8284 7.5 16.5 8.17157 16.5 9V21C16.5 21.8284 15.8284 22.5 15 22.5C14.1716 22.5 13.5 21.8284 13.5 21V9Z" fill="#E0A4B6" />
							<path d="M21 13.5C21.8284 13.5 22.5 14.1716 22.5 15C22.5 15.8284 21.8284 16.5 21 16.5L9 16.5C8.17157 16.5 7.5 15.8284 7.5 15C7.5 14.1716 8.17157 13.5 9 13.5L21 13.5Z" fill="#E0A4B6" />
							<rect x="0.5" y="0.5" width="29" height="29" rx="14.5" stroke="#E0A4B6" />
						</svg>
					</button>
				</div>
			</div>
		</section>
		<!-- END HEAD -->
		<!-- PRESSURE -->
		<section class="diary-main pressure">
			<div class="sort-container">
				<h1>Мои замеры давления</h1>
				<div class="sort-main">
					<div class="sort-item sort-period">
						<span class="text__xs">Показать</span>
						<button class="btn-select text__xs btnSelect" id="btn_select" type="button">
							Весь период
							<svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 1L5 5L1 0.999999" stroke="#333638" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
							</svg>
						</button>
						<div class="select-list hidden">
							<div class="select-group">
								<div class="input-group radio-inputs">
									<input class="radio-inputs-item" type="radio" name="periodSort" id="all" />
									<input class="radio-inputs-item" type="radio" name="periodSort" id="today" />
									<input class="radio-inputs-item" type="radio" name="periodSort" id="week" />
									<input class="radio-inputs-item" type="radio" name="periodSort" id="month" />
								</div>
								<div class="label-group">
									<label for="all">Весь период</label>
									<label for="today">Сегодня</label>
									<label for="week">За неделю</label>
									<label for="month">За месяц</label>
								</div>
							</div>
							<button class="btn-select-show" type="button">
								Показать
								<svg width="21" height="13" viewBox="0 0 21 13" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path opacity="0.9" d="M20.5303 7.03033C20.8232 6.73744 20.8232 6.26256 20.5303 5.96967L15.7574 1.1967C15.4645 0.903807 14.9896 0.903807 14.6967 1.1967C14.4038 1.48959 14.4038 1.96447 14.6967 2.25736L18.9393 6.5L14.6967 10.7426C14.4038 11.0355 14.4038 11.5104 14.6967 11.8033C14.9896 12.0962 15.4645 12.0962 15.7574 11.8033L20.5303 7.03033ZM-6.55671e-08 7.25L20 7.25L20 5.75L6.55671e-08 5.75L-6.55671e-08 7.25Z" fill="#BAC0CB" />
								</svg>
							</button>
						</div>
					</div>
					<div class="sort-item">
						<span class="text__xs">Поиск по дате</span>
						<div class="calendar-item">
							<input class="input-calendar text__xs range-calendar" type="date" placeholder="Выберите период" />
							<svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 1L5 5L1 0.999999" stroke="#333638" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
							</svg>
						</div>
					</div>
				</div>
				<div class="sort-main-mobile">
					<button class="btn-square-shadow sort-filter">
						<svg width="26" height="24" viewBox="0 0 26 24" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M24.5 2H2.5V5.17L9.91 12.59L10.5 13.17V22H14.5V20H16.5V22C16.5 22.5304 16.2893 23.0391 15.9142 23.4142C15.5391 23.7893 15.0304 24 14.5 24H10.5C9.96957 24 9.46086 23.7893 9.08579 23.4142C8.71072 23.0391 8.5 22.5304 8.5 22V14L1.09 6.59C0.902832 6.40394 0.754338 6.18268 0.653078 5.93897C0.551817 5.69526 0.499792 5.43391 0.500001 5.17V2C0.500001 1.46957 0.710714 0.960859 1.08579 0.585786C1.46086 0.210714 1.96957 0 2.5 0H24.5V2Z" fill="#4065AE" />
							<path d="M24.5 17L22.1389 14.6347L24.5 17ZM23.4474 11.4737C23.4474 12.6602 22.976 13.7981 22.1371 14.6371C21.2981 15.476 20.1602 15.9474 18.9737 15.9474C17.7872 15.9474 16.6493 15.476 15.8103 14.6371C14.9713 13.7981 14.5 12.6602 14.5 11.4737C14.5 10.2872 14.9713 9.14929 15.8103 8.31031C16.6493 7.47133 17.7872 7 18.9737 7C20.1602 7 21.2981 7.47133 22.1371 8.31031C22.976 9.14929 23.4474 10.2872 23.4474 11.4737V11.4737Z" stroke="#4065AE" stroke-width="2" stroke-linecap="round" />
						</svg>
					</button>
				</div>
			</div>
			<div class="share-button hidden">
				<button class="btn-square-transparent open-share-modal">
					Поделиться за выбранный период
					<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
						<path d="M8.0625 5.4375L12 1.5L15.9375 5.4375" stroke="#4065AE" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
						<path d="M12 12V1.5" stroke="#4065AE" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
						<path d="M16.5 9H18.75C18.9489 9 19.1397 9.07902 19.2803 9.21967C19.421 9.36032 19.5 9.55109 19.5 9.75V19.5C19.5 19.6989 19.421 19.8897 19.2803 20.0303C19.1397 20.171 18.9489 20.25 18.75 20.25H5.25C5.05109 20.25 4.86032 20.171 4.71967 20.0303C4.57902 19.8897 4.5 19.6989 4.5 19.5V9.75C4.5 9.55109 4.57902 9.36032 4.71967 9.21967C4.86032 9.07902 5.05109 9 5.25 9H7.5" stroke="#4065AE" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
					</svg>
				</button>
			</div>
			<div class="diary-container">
				<span class="text__xs">Сегодня</span>
				<div class="details">
					<div class="details-item">
						<div class="details-item-main">
							<div class="details-content">
								<div class="details-title">
									<span class="circle green"></span>
									<h3>Показатели в норме</h3>
								</div>
								<div class="details-time">
									<span class="text__xs">День, 14:00</span>
								</div>
							</div>
							<div class="details-content">
								<div class="details-numbs">
									<p>120/90</p>
									<span class="text__xs">Сис/Диа</span>
								</div>
								<div class="details-numbs">
									<p>62</p>
									<span class="text__xs">уд/сек</span>
								</div>
								<div class="details-edit">
									<button class="btn-details-edit btn-square" type="button">
										<span></span>
										<span></span>
										<span></span>
									</button>
									<ul class="details-edit-list hidden">
										<li>
											<a class="btn-edit-item btn-details-item" type="button">
												<div class="btn-square">
													<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
													</svg>
												</div>
												Редактировать
											</a>
										</li>
										<li>
											<a class="btn-delete-item btn-details-item" type="button">
												<div class="btn-square">
													<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
													</svg>
												</div>
												Удалить
											</a>
										</li>
									</ul>
								</div>
								<div class="details-more">
									<button class="btn-details-more btn-square" type="button">
										<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
										</svg>
									</button>
								</div>
							</div>
						</div>
						<div class="moreInfo">
							<div class="moreInfo-item">
								<div class="moreInfo-content">
									<h3>Ваше самочувствие</h3>
									<ul class="moreInfo-content-items">
										<li>Боль в спине</li>
										<li>Отек в ногах</li>
										<li>Головная боль</li>
										<li>Тремор в теле</li>
										<li>Головокружение</li>
									</ul>
								</div>
								<div class="moreInfo-content">
									<h3>Примечание</h3>
									<ul class="moreInfo-content-items">
										<li>Принял кардиомагнил</li>
										<li>Бег 20 минут</li>
										<li>Аритмия</li>
										<li>Аритмия, бисопролол</li>
									</ul>
								</div>
							</div>
							<div class="moreInfo-item comment">
								<h3>Комментарий</h3>
								<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
							</div>
						</div>
					</div>
					<div class="details-item">
						<div class="details-item-main">
							<div class="details-content">
								<div class="details-title">
									<span class="circle green"></span>
									<h3>Показатели в норме</h3>
								</div>
								<div class="details-time">
									<span class="text__xs">Утро, 09:00</span>
								</div>
							</div>
							<div class="details-content">
								<div class="details-numbs">
									<p>120/90</p>
									<span class="text__xs">Сис/Диа</span>
								</div>
								<div class="details-numbs">
									<p>62</p>
									<span class="text__xs">уд/сек</span>
								</div>
								<div class="details-edit">
									<button class="btn-details-edit btn-square" type="button">
										<span></span>
										<span></span>
										<span></span>
									</button>
									<ul class="details-edit-list hidden">
										<li>
											<a class="btn-edit-item btn-details-item" type="button">
												<div class="btn-square">
													<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
													</svg>
												</div>
												Редактировать
											</a>
										</li>
										<li>
											<a class="btn-delete-item btn-details-item" type="button">
												<div class="btn-square">
													<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
													</svg>
												</div>
												Удалить
											</a>
										</li>
									</ul>
								</div>
								<div class="details-more">
									<button class="btn-details-more btn-square" type="button">
										<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
										</svg>
									</button>
								</div>
							</div>
						</div>
						<div class="moreInfo">
							<div class="moreInfo-item">
								<div class="moreInfo-content">
									<h3>Ваше самочувствие</h3>
									<ul class="moreInfo-content-items">
										<li>Боль в спине</li>
										<li>Отек в ногах</li>
										<li>Головная боль</li>
										<li>Тремор в теле</li>
										<li>Головокружение</li>
									</ul>
								</div>
								<div class="moreInfo-content">
									<h3>Примечание</h3>
									<ul class="moreInfo-content-items">
										<li>Принял кардиомагнил</li>
										<li>Бег 20 минут</li>
										<li>Аритмия</li>
										<li>Аритмия, бисопролол</li>
									</ul>
								</div>
							</div>
							<div class="moreInfo-item comment">
								<h3>Комментарий</h3>
								<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
							</div>
						</div>
					</div>
				</div>
				<div class="diary-container">
					<button class="text__xs collapse-period" type="button">
						Прошедший период
						<svg class="more-icon" width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M11 6L6 1L1 6" stroke="#5B6373" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round" />
						</svg>
					</button>
					<div class="past-period hidden">
						<span class="text__xs">Вчера</span>
						<div class="details">
							<div class="details-item">
								<div class="details-item-main">
									<div class="details-content">
										<div class="details-title">
											<span class="circle red"></span>
											<h3>Повышенное давление</h3>
										</div>
										<div class="details-time">
											<span class="text__xs">Вечер, 20:00</span>
										</div>
									</div>
									<div class="details-content">
										<div class="details-numbs">
											<p>140/90</p>
											<span class="text__xs">Сис/Диа</span>
										</div>
										<div class="details-numbs">
											<p>70</p>
											<span class="text__xs">уд/сек</span>
										</div>
										<div class="details-edit">
											<button class="btn-details-edit btn-square" type="button">
												<span></span>
												<span></span>
												<span></span>
											</button>
											<ul class="details-edit-list hidden">
												<li>
													<a class="btn-edit-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
															</svg>
														</div>
														Редактировать
													</a>
												</li>
												<li>
													<a class="btn-delete-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
															</svg>
														</div>
														Удалить
													</a>
												</li>
											</ul>
										</div>
										<div class="details-more">
											<button class="btn-details-more btn-square" type="button">
												<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
												</svg>
											</button>
										</div>
									</div>
								</div>
								<div class="moreInfo">
									<div class="moreInfo-item">
										<div class="moreInfo-content">
											<h3>Ваше самочувствие</h3>
											<ul class="moreInfo-content-items">
												<li>Боль в спине</li>
												<li>Отек в ногах</li>
												<li>Головная боль</li>
												<li>Тремор в теле</li>
												<li>Головокружение</li>
											</ul>
										</div>
										<div class="moreInfo-content">
											<h3>Примечание</h3>
											<ul class="moreInfo-content-items">
												<li>Принял кардиомагнил</li>
												<li>Бег 20 минут</li>
												<li>Аритмия</li>
												<li>Аритмия, бисопролол</li>
											</ul>
										</div>
									</div>
									<div class="moreInfo-item comment">
										<h3>Комментарий</h3>
										<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
									</div>
								</div>
							</div>
							<div class="details-item">
								<div class="details-item-main">
									<div class="details-content">
										<div class="details-title">
											<span class="circle yellow"></span>
											<h3>Пониженное давление</h3>
										</div>
										<div class="details-time">
											<span class="text__xs">День, 13:00</span>
										</div>
									</div>
									<div class="details-content">
										<div class="details-numbs">
											<p>75/55</p>
											<span class="text__xs">Сис/Диа</span>
										</div>
										<div class="details-numbs">
											<p>62</p>
											<span class="text__xs">уд/сек</span>
										</div>
										<div class="details-edit">
											<button class="btn-details-edit btn-square" type="button">
												<span></span>
												<span></span>
												<span></span>
											</button>
											<ul class="details-edit-list hidden">
												<li>
													<a class="btn-edit-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
															</svg>
														</div>
														Редактировать
													</a>
												</li>
												<li>
													<a class="btn-delete-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
															</svg>
														</div>
														Удалить
													</a>
												</li>
											</ul>
										</div>
										<div class="details-more">
											<button class="btn-details-more btn-square" type="button">
												<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
												</svg>
											</button>
										</div>
									</div>
								</div>
								<div class="moreInfo">
									<div class="moreInfo-item">
										<div class="moreInfo-content">
											<h3>Ваше самочувствие</h3>
											<ul class="moreInfo-content-items">
												<li>Боль в спине</li>
												<li>Отек в ногах</li>
												<li>Головная боль</li>
												<li>Тремор в теле</li>
												<li>Головокружение</li>
											</ul>
										</div>
										<div class="moreInfo-content">
											<h3>Примечание</h3>
											<ul class="moreInfo-content-items">
												<li>Принял кардиомагнил</li>
												<li>Бег 20 минут</li>
												<li>Аритмия</li>
												<li>Аритмия, бисопролол</li>
											</ul>
										</div>
									</div>
									<div class="moreInfo-item comment">
										<h3>Комментарий</h3>
										<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
									</div>
								</div>
							</div>
							<div class="details-item">
								<div class="details-item-main">
									<div class="details-content">
										<div class="details-title">
											<span class="circle green"></span>
											<h3>Показатели в норме</h3>
										</div>
										<div class="details-time">
											<span class="text__xs">Утро, 09:54</span>
										</div>
									</div>
									<div class="details-content">
										<div class="details-numbs">
											<p>120/90</p>
											<span class="text__xs">Сис/Диа</span>
										</div>
										<div class="details-numbs">
											<p>60</p>
											<span class="text__xs">уд/сек</span>
										</div>
										<div class="details-edit">
											<button class="btn-details-edit btn-square" type="button">
												<span></span>
												<span></span>
												<span></span>
											</button>
											<ul class="details-edit-list hidden">
												<li>
													<a class="btn-edit-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
															</svg>
														</div>
														Редактировать
													</a>
												</li>
												<li>
													<a class="btn-delete-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
															</svg>
														</div>
														Удалить
													</a>
												</li>
											</ul>
										</div>
										<div class="details-more">
											<button class="btn-details-more btn-square" type="button">
												<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
												</svg>
											</button>
										</div>
									</div>
								</div>
								<div class="moreInfo">
									<div class="moreInfo-item">
										<div class="moreInfo-content">
											<h3>Ваше самочувствие</h3>
											<ul class="moreInfo-content-items">
												<li>Боль в спине</li>
												<li>Отек в ногах</li>
												<li>Головная боль</li>
												<li>Тремор в теле</li>
												<li>Головокружение</li>
											</ul>
										</div>
										<div class="moreInfo-content">
											<h3>Примечание</h3>
											<ul class="moreInfo-content-items">
												<li>Принял кардиомагнил</li>
												<li>Бег 20 минут</li>
												<li>Аритмия</li>
												<li>Аритмия, бисопролол</li>
											</ul>
										</div>
									</div>
									<div class="moreInfo-item comment">
										<h3>Комментарий</h3>
										<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
									</div>
								</div>
							</div>
						</div>
						<span class="text__xs">04.05.2022</span>
						<div class="details">
							<div class="details-item">
								<div class="details-item-main">
									<div class="details-content">
										<div class="details-title">
											<span class="circle red"></span>
											<h3>Повышенное давление</h3>
										</div>
										<div class="details-time">
											<span class="text__xs">Вечер, 20:00</span>
										</div>
									</div>
									<div class="details-content">
										<div class="details-numbs">
											<p>140/110</p>
											<span class="text__xs">Сис/Диа</span>
										</div>
										<div class="details-numbs">
											<p>110</p>
											<span class="text__xs">уд/сек</span>
										</div>
										<div class="details-edit">
											<button class="btn-details-edit btn-square" type="button">
												<span></span>
												<span></span>
												<span></span>
											</button>
											<ul class="details-edit-list hidden">
												<li>
													<a class="btn-edit-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
															</svg>
														</div>
														Редактировать
													</a>
												</li>
												<li>
													<a class="btn-delete-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
															</svg>
														</div>
														Удалить
													</a>
												</li>
											</ul>
										</div>
										<div class="details-more">
											<button class="btn-details-more btn-square" type="button">
												<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
												</svg>
											</button>
										</div>
									</div>
								</div>
								<div class="moreInfo">
									<div class="moreInfo-item">
										<div class="moreInfo-content">
											<h3>Ваше самочувствие</h3>
											<ul class="moreInfo-content-items">
												<li>Боль в спине</li>
												<li>Отек в ногах</li>
												<li>Головная боль</li>
												<li>Тремор в теле</li>
												<li>Головокружение</li>
											</ul>
										</div>
										<div class="moreInfo-content">
											<h3>Примечание</h3>
											<ul class="moreInfo-content-items">
												<li>Принял кардиомагнил</li>
												<li>Бег 20 минут</li>
												<li>Аритмия</li>
												<li>Аритмия, бисопролол</li>
											</ul>
										</div>
									</div>
									<div class="moreInfo-item comment">
										<h3>Комментарий</h3>
										<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
									</div>
								</div>
							</div>
						</div>
						<span class="text__xs">17.04.2022</span>
						<div class="details">
							<div class="details-item">
								<div class="details-item-main">
									<div class="details-content">
										<div class="details-title">
											<span class="circle green"></span>
											<h3>Показатели в норме</h3>
										</div>
										<div class="details-time">
											<span class="text__xs">Вечер, 20:00</span>
										</div>
									</div>
									<div class="details-content">
										<div class="details-numbs">
											<p>120/80</p>
											<span class="text__xs">Сис/Диа</span>
										</div>
										<div class="details-numbs">
											<p>60</p>
											<span class="text__xs">уд/сек</span>
										</div>
										<div class="details-edit">
											<button class="btn-details-edit btn-square" type="button">
												<span></span>
												<span></span>
												<span></span>
											</button>
											<ul class="details-edit-list hidden">
												<li>
													<a class="btn-edit-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
															</svg>
														</div>
														Редактировать
													</a>
												</li>
												<li>
													<a class="btn-delete-item btn-details-item" type="button">
														<div class="btn-square">
															<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
															</svg>
														</div>
														Удалить
													</a>
												</li>
											</ul>
										</div>
										<div class="details-more">
											<button class="btn-details-more btn-square" type="button">
												<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
												</svg>
											</button>
										</div>
									</div>
								</div>
								<div class="moreInfo">
									<div class="moreInfo-item">
										<div class="moreInfo-content">
											<h3>Ваше самочувствие</h3>
											<ul class="moreInfo-content-items">
												<li>Боль в спине</li>
												<li>Отек в ногах</li>
												<li>Головная боль</li>
												<li>Тремор в теле</li>
												<li>Головокружение</li>
											</ul>
										</div>
										<div class="moreInfo-content">
											<h3>Примечание</h3>
											<ul class="moreInfo-content-items">
												<li>Принял кардиомагнил</li>
												<li>Бег 20 минут</li>
												<li>Аритмия</li>
												<li>Аритмия, бисопролол</li>
											</ul>
										</div>
									</div>
									<div class="moreInfo-item comment">
										<h3>Комментарий</h3>
										<p>Ясность нашей позиции очевидна: социально-экономическое развитие в значительной степени обусловливает важность поставленных обществом задач</p>
									</div>
								</div>
							</div>
						</div>
					</div>
				</div>
			</div>
		</section>
		<!-- END PRESSURE -->
		<!-- REMINDER -->
		<section id="main__reminder" class="diary-main reminder">
			<div class="reminder-title">
				<h1>Мои напоминания</h1>
				<p>Теперь вы никогда не забудете выпить лекарство. Добавляйте в напоминания свои заметки, чтобы не забыть о важном</p>
			</div>
			<div class="diary-content">
				<div class="head-main">
					<div class="head-title">
						<button class="head-title-icon btn-add-task" type="button">
							<svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M7.50084 2C7.50084 1.17157 8.17241 0.5 9.00084 0.5C9.82926 0.5 10.5008 1.17157 10.5008 2V16C10.5008 16.8284 9.82926 17.5 9.00084 17.5C8.17241 17.5 7.50084 16.8284 7.50084 16V2Z" fill="white" />
								<path d="M2 10.5C1.17157 10.5 0.5 9.82843 0.5 9C0.5 8.17157 1.17157 7.5 2 7.5L16 7.5C16.8284 7.5 17.5 8.17157 17.5 9C17.5 9.82843 16.8284 10.5 16 10.5L2 10.5Z" fill="white" />
							</svg>
						</button>
						<div class="head-title-content">
							<h2>Добавить задачу</h2>
							<span class="text__xs">Описание к задаче</span>
						</div>
					</div>
					<div class="btns-group">
						<div class="add-remind add-date">
							<button class="btn-square-shadow btn-add-remind" type="button">
								<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
									<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#E71E5A" />
									<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#B71C1C" />
									<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#B71C1C" />
									<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
									<path d="M5.51172 10.5254H7.87069V12.8844H5.51172V10.5254ZM9.05018 10.5254H11.4092V12.8844H9.05018V10.5254ZM12.5886 10.5254H14.9476V12.8844H12.5886V10.5254ZM16.1271 10.5254H18.4861V12.8844H16.1271V10.5254ZM5.51172 14.0639H7.87069V16.4228H5.51172V14.0639ZM9.05018 14.0639H11.4092V16.4228H9.05018V14.0639ZM12.5886 14.0639H14.9476V16.4228H12.5886V14.0639ZM16.1271 14.0639H18.4861V16.4228H16.1271V14.0639ZM5.51172 17.6023H7.87069V19.9613H5.51172V17.6023ZM9.05018 17.6023H11.4092V19.9613H9.05018V17.6023ZM12.5886 17.6023H14.9476V19.9613H12.5886V17.6023ZM16.1271 17.6023H18.4861V19.9613H16.1271V17.6023Z" fill="#90A4AE" />
								</svg>
								<span class="text__xs add-date-name">Добавить дату выполнения</span>
							</button>
							<div class="add-date-list select-list hidden">
								<p>Добавить дату выполнения</p>
								<div class="select-group">
									<div class="input-group">
										<input type="radio" name="periodSort" id="to_today" />
										<input type="radio" name="periodSort" id="to_tomorrow" />
										<input type="radio" name="periodSort" id="to_nextWeek" />
									</div>
									<div class="label-group">
										<label for="to_today">Сегодня</label>
										<label for="to_tomorrow">Завтра</label>
										<label for="to_nextWeek">Следующая неделя</label>
									</div>
								</div>
								<div class="calendar-item">
									<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
										<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#E71E5A" />
										<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#B71C1C" />
										<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#B71C1C" />
										<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
										<path d="M5.51172 10.5254H7.87069V12.8844H5.51172V10.5254ZM9.05018 10.5254H11.4092V12.8844H9.05018V10.5254ZM12.5886 10.5254H14.9476V12.8844H12.5886V10.5254ZM16.1271 10.5254H18.4861V12.8844H16.1271V10.5254ZM5.51172 14.0639H7.87069V16.4228H5.51172V14.0639ZM9.05018 14.0639H11.4092V16.4228H9.05018V14.0639ZM12.5886 14.0639H14.9476V16.4228H12.5886V14.0639ZM16.1271 14.0639H18.4861V16.4228H16.1271V14.0639ZM5.51172 17.6023H7.87069V19.9613H5.51172V17.6023ZM9.05018 17.6023H11.4092V19.9613H9.05018V17.6023ZM12.5886 17.6023H14.9476V19.9613H12.5886V17.6023ZM16.1271 17.6023H18.4861V19.9613H16.1271V17.6023Z" fill="#90A4AE" />
									</svg>
									<input class="input-calendar text__xs" id="calendar3" type="date" placeholder="Выбрать дату" />
								</div>
							</div>
						</div>
						<div class="add-remind add-remind-container">
							<button class="btn-square-shadow btn-add-remind" type="button">
								<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
									<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
									<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
									<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
									<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
									<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
									<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
								</svg>
								<span class="text__xs add-date-name">Добавить напоминание</span>
							</button>
							<div class="add-date-list select-list hidden">
								<p>Напомнить мне</p>
								<div class="select-group">
									<div class="input-group">
										<input type="radio" name="periodSort" id="remindMe1" />
										<input type="radio" name="periodSort" id="remindMe2" />
										<input type="radio" name="periodSort" id="remindMe3" />
										<input type="radio" name="periodSort" id="remindMe4" />
										<input type="radio" name="periodSort" id="remindMe5" />
										<input type="radio" name="periodSort" id="remindMe6" />
										<input type="radio" name="periodSort" id="remindMe7" />
										<input type="radio" name="periodSort" id="remindMe8" />
										<input type="radio" name="periodSort" id="remindMe9" />
										<input type="radio" name="periodSort" id="remindMe10" />
									</div>
									<div class="label-group">
										<label for="remindMe1">Во время события</label>
										<label for="remindMe2">Не напоминать</label>
										<label for="remindMe3">За 5 минут</label>
										<label for="remindMe4">За 10 минут</label>
										<label for="remindMe5">За 15 минут</label>
										<label for="remindMe6">За 30 минут</label>
										<label for="remindMe7">За 1 час</label>
										<label for="remindMe8">За 2 часа</label>
										<label for="remindMe9">За 1 день</label>
										<label for="remindMe10">За 2 дня</label>
									</div>
								</div>
								<div class="submit-forze">
									<button class="btn">
										<span class="btn-content">
											<span>Добавить</span>
											<div class="btn__circle">
												<i class="bi bi-chevron-right"></i>
											</div>
										</span>
									</button>
								</div>
							</div>
						</div>
						<div class="add-remind add-repeat">
							<button class="btn-square-shadow btn-add-remind" type="button">
								<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
									<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
									<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
									<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
									<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
									<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
								</svg>
								<span class="text__xs add-date-name">Добавить повторение</span>
							</button>
							<div id="dateList" class="add-date-list select-list hidden">
								<p>Добавить дату выполнения</p>
								<div class="select-group">
									<div class="input-group">
										<input type="radio" name="periodSort" id="oneTime" />
										<input type="radio" name="periodSort" id="everyday" />
										<input type="radio" name="periodSort" id="workingDay" />
										<input type="radio" name="periodSort" id="weekend" />
									</div>
									<div class="label-group">
										<label for="oneTime">Один раз</label>
										<label for="everyday">Ежедневно</label>
										<label for="workingDay">Рабочие дни</label>
										<label for="weekend">Выходные дни</label>
									</div>
								</div>
								<div class="calendar-item">
									<button class="btn-choose-date" type="button">
										<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
											<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
											<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#E71E5A" />
											<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#B71C1C" />
											<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#B71C1C" />
											<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
											<path d="M5.51172 10.5254H7.87069V12.8844H5.51172V10.5254ZM9.05018 10.5254H11.4092V12.8844H9.05018V10.5254ZM12.5886 10.5254H14.9476V12.8844H12.5886V10.5254ZM16.1271 10.5254H18.4861V12.8844H16.1271V10.5254ZM5.51172 14.0639H7.87069V16.4228H5.51172V14.0639ZM9.05018 14.0639H11.4092V16.4228H9.05018V14.0639ZM12.5886 14.0639H14.9476V16.4228H12.5886V14.0639ZM16.1271 14.0639H18.4861V16.4228H16.1271V14.0639ZM5.51172 17.6023H7.87069V19.9613H5.51172V17.6023ZM9.05018 17.6023H11.4092V19.9613H9.05018V17.6023ZM12.5886 17.6023H14.9476V19.9613H12.5886V17.6023ZM16.1271 17.6023H18.4861V19.9613H16.1271V17.6023Z" fill="#90A4AE" />
										</svg>
										Выбрать дни
									</button>
								</div>
							</div>
							<div class="choose-date-list hidden">
								<button class="btn-choose-date-back" type="button">
									<svg width="14" height="12" viewBox="0 0 14 12" fill="none" xmlns="http://www.w3.org/2000/svg">
										<path d="M13 6.75C13.4142 6.75 13.75 6.41421 13.75 6C13.75 5.58579 13.4142 5.25 13 5.25V6.75ZM0.46967 5.46967C0.176777 5.76256 0.176777 6.23744 0.46967 6.53033L5.24264 11.3033C5.53553 11.5962 6.01041 11.5962 6.3033 11.3033C6.59619 11.0104 6.59619 10.5355 6.3033 10.2426L2.06066 6L6.3033 1.75736C6.59619 1.46447 6.59619 0.989593 6.3033 0.696699C6.01041 0.403806 5.53553 0.403806 5.24264 0.696699L0.46967 5.46967ZM13 5.25L1 5.25V6.75L13 6.75V5.25Z" fill="#4065AE" />
									</svg>
									Назад
								</button>
								<div class="choose-date-group">
									<div class="input-group">
										<input type="radio" name="periodSort" id="oneTime" />
										<input type="radio" name="periodSort" id="everyday" />
										<input type="radio" name="periodSort" id="workingDay" />
										<input type="radio" name="periodSort" id="weekend" />
									</div>
									<div class="label-group">
										<label for="oneTime">Один раз</label>
										<label for="everyday">Ежедневно</label>
										<label for="workingDay">Рабочие дни</label>
										<label for="weekend">Выходные дни</label>
									</div>
								</div>
								<div class="submit-forze">
									<button class="btn">
										<span class="btn-content">
											<span>Добавить</span>
											<div class="btn__circle">
												<i class="bi bi-chevron-right"></i>
											</div>
										</span>
									</button>
								</div>
							</div>
						</div>
					</div>
				</div>
				<div class="diary-item">
					<button class="text__xs collapse-item" type="button">
						<svg class="mobile-icon" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
							<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#E71E5A" />
							<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#B71C1C" />
							<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#B71C1C" />
							<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
							<path d="M5.51172 10.5254H7.87069V12.8844H5.51172V10.5254ZM9.05018 10.5254H11.4092V12.8844H9.05018V10.5254ZM12.5886 10.5254H14.9476V12.8844H12.5886V10.5254ZM16.1271 10.5254H18.4861V12.8844H16.1271V10.5254ZM5.51172 14.0639H7.87069V16.4228H5.51172V14.0639ZM9.05018 14.0639H11.4092V16.4228H9.05018V14.0639ZM12.5886 14.0639H14.9476V16.4228H12.5886V14.0639ZM16.1271 14.0639H18.4861V16.4228H16.1271V14.0639ZM5.51172 17.6023H7.87069V19.9613H5.51172V17.6023ZM9.05018 17.6023H11.4092V19.9613H9.05018V17.6023ZM12.5886 17.6023H14.9476V19.9613H12.5886V17.6023ZM16.1271 17.6023H18.4861V19.9613H16.1271V17.6023Z" fill="#90A4AE" />
						</svg>
						Сегодня
						<svg class="more-icon" width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M11 6L6 1L1 6" stroke="#5B6373" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round" />
						</svg>
					</button>
					<div class="details">
						<div class="details-item">
							<div class="details-item-main">
								<div class="details-content">
									<input type="checkbox" class="remind-select" />
									<div class="details-title">
										<h2 class="details-content-title">Выпить карвалол</h2>
										<span class="details-time text__xs">Вечер, 20:00</span>
									</div>
								</div>
								<div class="details-content">
									<div class="details-edit">
										<button class="btn-details-edit btn-square" type="button">
											<span></span>
											<span></span>
											<span></span>
										</button>
										<ul class="details-edit-list hidden">
											<li>
												<a class="btn-edit-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
														</svg>
													</div>
													Редактировать
												</a>
											</li>
											<li>
												<a class="btn-delete-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
														</svg>
													</div>
													Удалить
												</a>
											</li>
										</ul>
									</div>
									<div class="details-more">
										<button class="btn-details-more btn-square" type="button">
											<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
											</svg>
										</button>
									</div>
								</div>
							</div>
							<div class="moreInfo">
								<div class="moreInfo-item">
									<div class="moreInfo-content">
										<span class="text__xs">Если будет высокое выпить Карвалол, если низкое выпить стакан кофе</span>
									</div>
									<div class="moreInfo-content">
										<ul class="moreInfo-content-items">
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
													<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
													<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
													<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
													<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
													<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
													<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
												</svg>
												Напомнить: в 20:00
											</li>
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
													<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
													<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
													<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
													<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
													<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
												</svg>
												Повтор: Ежедневно
											</li>
										</ul>
									</div>
								</div>
							</div>
						</div>
						<div class="details-item">
							<div class="details-item-main">
								<div class="details-content">
									<input type="checkbox" class="remind-select" />
									<div class="details-title">
										<h2>Принять лекарства</h2>
										<span class="details-time text__xs">День, 14:00</span>
									</div>
								</div>
								<div class="details-content">
									<div class="details-edit">
										<button class="btn-details-edit btn-square" type="button">
											<span></span>
											<span></span>
											<span></span>
										</button>
										<ul class="details-edit-list hidden">
											<li>
												<a class="btn-edit-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
														</svg>
													</div>
													Редактировать
												</a>
											</li>
											<li>
												<a class="btn-delete-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
														</svg>
													</div>
													Удалить
												</a>
											</li>
										</ul>
									</div>
									<div class="details-more">
										<button class="btn-details-more btn-square" type="button">
											<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
											</svg>
										</button>
									</div>
								</div>
							</div>
							<div class="moreInfo">
								<div class="moreInfo-item">
									<div class="moreInfo-content">
										<span class="text__xs">Если будет высокое выпить Карвалол, если низкое выпить стакан кофе</span>
									</div>
									<div class="moreInfo-content">
										<ul class="moreInfo-content-items">
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
													<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
													<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
													<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
													<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
													<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
													<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
												</svg>
												Напомнить: в 20:00
											</li>
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
													<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
													<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
													<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
													<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
													<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
												</svg>
												Повтор: Ежедневно
											</li>
										</ul>
									</div>
								</div>
							</div>
						</div>
						<div class="details-item">
							<div class="details-item-main">
								<div class="details-content">
									<input type="checkbox" class="remind-select" />
									<div class="details-title">
										<h2>Выпить валидол</h2>
										<span class="details-time text__xs">Утро, 09:00</span>
									</div>
								</div>
								<div class="details-content">
									<div class="details-edit">
										<button class="btn-details-edit btn-square" type="button">
											<span></span>
											<span></span>
											<span></span>
										</button>
										<ul class="details-edit-list hidden">
											<li>
												<a class="btn-edit-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
														</svg>
													</div>
													Редактировать
												</a>
											</li>
											<li>
												<a class="btn-delete-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
														</svg>
													</div>
													Удалить
												</a>
											</li>
										</ul>
									</div>
									<div class="details-more">
										<button class="btn-details-more btn-square" type="button">
											<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
											</svg>
										</button>
									</div>
								</div>
							</div>
							<div class="moreInfo">
								<div class="moreInfo-item">
									<div class="moreInfo-content">
										<span class="text__xs">Если будет высокое выпить Карвалол, если низкое выпить стакан кофе</span>
									</div>
									<div class="moreInfo-content">
										<ul class="moreInfo-content-items">
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
													<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
													<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
													<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
													<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
													<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
													<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
												</svg>
												Напомнить: в 20:00
											</li>
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
													<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
													<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
													<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
													<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
													<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
												</svg>
												Повтор: Ежедневно
											</li>
										</ul>
									</div>
								</div>
							</div>
						</div>
					</div>
				</div>
				<div class="diary-item">
					<button class="text__xs collapse-item" type="button">
						<svg class="mobile-icon" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
							<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#E71E5A" />
							<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#B71C1C" />
							<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#B71C1C" />
							<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
							<path d="M5.51172 10.5254H7.87069V12.8844H5.51172V10.5254ZM9.05018 10.5254H11.4092V12.8844H9.05018V10.5254ZM12.5886 10.5254H14.9476V12.8844H12.5886V10.5254ZM16.1271 10.5254H18.4861V12.8844H16.1271V10.5254ZM5.51172 14.0639H7.87069V16.4228H5.51172V14.0639ZM9.05018 14.0639H11.4092V16.4228H9.05018V14.0639ZM12.5886 14.0639H14.9476V16.4228H12.5886V14.0639ZM16.1271 14.0639H18.4861V16.4228H16.1271V14.0639ZM5.51172 17.6023H7.87069V19.9613H5.51172V17.6023ZM9.05018 17.6023H11.4092V19.9613H9.05018V17.6023ZM12.5886 17.6023H14.9476V19.9613H12.5886V17.6023ZM16.1271 17.6023H18.4861V19.9613H16.1271V17.6023Z" fill="#90A4AE" />
						</svg>
						Завершенные
						<svg class="more-icon" width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M11 6L6 1L1 6" stroke="#5B6373" stroke-width="1.7" stroke-linecap="round" stroke-linejoin="round" />
						</svg>
					</button>
					<div class="details">
						<div class="details-item">
							<div class="details-item-main">
								<div class="details-content">
									<input type="checkbox" class="remind-select" checked />
									<div class="details-title">
										<h2 class="details-content-title inactive">Принять лекарства</h2>
										<span class="details-time text__xs">Вчера, 19:00</span>
									</div>
								</div>
								<div class="details-content">
									<div class="details-edit">
										<button class="btn-details-edit btn-square" type="button">
											<span></span>
											<span></span>
											<span></span>
										</button>
										<ul class="details-edit-list hidden">
											<li>
												<a class="btn-edit-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
														</svg>
													</div>
													Редактировать
												</a>
											</li>
											<li>
												<a class="btn-delete-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
														</svg>
													</div>
													Удалить
												</a>
											</li>
										</ul>
									</div>
									<div class="details-more">
										<button class="btn-details-more btn-square" type="button">
											<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
											</svg>
										</button>
									</div>
								</div>
							</div>
							<div class="moreInfo">
								<div class="moreInfo-item">
									<div class="moreInfo-content">
										<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
									</div>
									<div class="moreInfo-content">
										<ul class="moreInfo-content-items">
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
													<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
													<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
													<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
													<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
													<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
													<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
												</svg>
												Напомнить: за 1 час
											</li>
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
													<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
													<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
													<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
													<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
													<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
												</svg>
												Повтор: Пн, ср. пт
											</li>
										</ul>
									</div>
								</div>
							</div>
						</div>
						<div class="details-item">
							<div class="details-item-main">
								<div class="details-content">
									<input type="checkbox" class="remind-select" checked />
									<div class="details-title">
										<h2 class="details-content-title inactive">Выпить Валидол</h2>
										<span class="details-time text__xs">Вчера, 14:00</span>
									</div>
								</div>
								<div class="details-content">
									<div class="details-edit">
										<button class="btn-details-edit btn-square" type="button">
											<span></span>
											<span></span>
											<span></span>
										</button>
										<ul class="details-edit-list hidden">
											<li>
												<a class="btn-edit-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
														</svg>
													</div>
													Редактировать
												</a>
											</li>
											<li>
												<a class="btn-delete-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
														</svg>
													</div>
													Удалить
												</a>
											</li>
										</ul>
									</div>
									<div class="details-more">
										<button class="btn-details-more btn-square" type="button">
											<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
											</svg>
										</button>
									</div>
								</div>
							</div>
							<div class="moreInfo">
								<div class="moreInfo-item">
									<div class="moreInfo-content">
										<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
									</div>
									<div class="moreInfo-content">
										<ul class="moreInfo-content-items">
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
													<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
													<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
													<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
													<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
													<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
													<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
												</svg>
												Напомнить: за 1 час
											</li>
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
													<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
													<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
													<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
													<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
													<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
												</svg>
												Повтор: Пн, ср. пт
											</li>
										</ul>
									</div>
								</div>
							</div>
						</div>
						<div class="details-item">
							<div class="details-item-main">
								<div class="details-content">
									<input type="checkbox" class="remind-select" checked />
									<div class="details-title">
										<h2 class="details-content-title inactive">Выпить Валидол</h2>
										<span class="details-time text__xs">15.06.2022, 10:00</span>
									</div>
								</div>
								<div class="details-content">
									<div class="details-edit">
										<button class="btn-details-edit btn-square" type="button">
											<span></span>
											<span></span>
											<span></span>
										</button>
										<ul class="details-edit-list hidden">
											<li>
												<a class="btn-edit-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
														</svg>
													</div>
													Редактировать
												</a>
											</li>
											<li>
												<a class="btn-delete-item btn-details-item" type="button">
													<div class="btn-square">
														<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
														</svg>
													</div>
													Удалить
												</a>
											</li>
										</ul>
									</div>
									<div class="details-more">
										<button class="btn-details-more btn-square" type="button">
											<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
												<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
											</svg>
										</button>
									</div>
								</div>
							</div>
							<div class="moreInfo">
								<div class="moreInfo-item">
									<div class="moreInfo-content">
										<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
									</div>
									<div class="moreInfo-content">
										<ul class="moreInfo-content-items">
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
													<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
													<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
													<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
													<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
													<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
													<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
												</svg>
												Напомнить: за 1 час
											</li>
											<li>
												<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
													<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
													<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
													<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
													<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
													<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
													<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
												</svg>
												Повтор: Пн, ср. пт
											</li>
										</ul>
									</div>
								</div>
							</div>
						</div>
						<div class="show-more">
							<div class="show-more-btn">
								<button class="btn-showMore btn-square-blue" type="button">Показать еще</button>
							</div>
							<div class="hidden-details details hidden">
								<div class="details-item">
									<div class="details-item-main">
										<div class="details-content">
											<input type="checkbox" class="remind-select" checked />
											<div class="details-title">
												<h2 class="details-content-title inactive">Выпить Валидол</h2>
												<span class="details-time text__xs">Вчера, 14:00</span>
											</div>
										</div>
										<div class="details-content">
											<div class="details-edit">
												<button class="btn-details-edit btn-square" type="button">
													<span></span>
													<span></span>
													<span></span>
												</button>
												<ul class="details-edit-list hidden">
													<li>
														<a class="btn-edit-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
																</svg>
															</div>
															Редактировать
														</a>
													</li>
													<li>
														<a class="btn-delete-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
																</svg>
															</div>
															Удалить
														</a>
													</li>
												</ul>
											</div>
											<div class="details-more">
												<button class="btn-details-more btn-square" type="button">
													<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
													</svg>
												</button>
											</div>
										</div>
									</div>
									<div class="moreInfo">
										<div class="moreInfo-item">
											<div class="moreInfo-content">
												<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
											</div>
											<div class="moreInfo-content">
												<ul class="moreInfo-content-items">
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
															<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
															<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
															<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
															<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
															<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
															<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
														</svg>
														Напомнить: за 1 час
													</li>
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
															<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
															<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
															<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
															<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
															<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
														</svg>
														Повтор: Пн, ср. пт
													</li>
												</ul>
											</div>
										</div>
									</div>
								</div>
								<div class="details-item">
									<div class="details-item-main">
										<div class="details-content">
											<input type="checkbox" class="remind-select" checked />
											<div class="details-title">
												<h2 class="details-content-title inactive">Выпить Валидол</h2>
												<span class="details-time text__xs">15.06.2022, 10:00</span>
											</div>
										</div>
										<div class="details-content">
											<div class="details-edit">
												<button class="btn-details-edit btn-square" type="button">
													<span></span>
													<span></span>
													<span></span>
												</button>
												<ul class="details-edit-list hidden">
													<li>
														<a class="btn-edit-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
																</svg>
															</div>
															Редактировать
														</a>
													</li>
													<li>
														<a class="btn-delete-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
																</svg>
															</div>
															Удалить
														</a>
													</li>
												</ul>
											</div>
											<div class="details-more">
												<button class="btn-details-more btn-square" type="button">
													<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
													</svg>
												</button>
											</div>
										</div>
									</div>
									<div class="moreInfo">
										<div class="moreInfo-item">
											<div class="moreInfo-content">
												<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
											</div>
											<div class="moreInfo-content">
												<ul class="moreInfo-content-items">
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
															<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
															<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
															<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
															<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
															<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
															<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
														</svg>
														Напомнить: за 1 час
													</li>
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
															<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
															<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
															<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
															<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
															<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
														</svg>
														Повтор: Пн, ср. пт
													</li>
												</ul>
											</div>
										</div>
									</div>
								</div>
								<div class="details-item">
									<div class="details-item-main">
										<div class="details-content">
											<input type="checkbox" class="remind-select" checked />
											<div class="details-title">
												<h2 class="details-content-title inactive">Выпить Валидол</h2>
												<span class="details-time text__xs">Вчера, 14:00</span>
											</div>
										</div>
										<div class="details-content">
											<div class="details-edit">
												<button class="btn-details-edit btn-square" type="button">
													<span></span>
													<span></span>
													<span></span>
												</button>
												<ul class="details-edit-list hidden">
													<li>
														<a class="btn-edit-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
																</svg>
															</div>
															Редактировать
														</a>
													</li>
													<li>
														<a class="btn-delete-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
																</svg>
															</div>
															Удалить
														</a>
													</li>
												</ul>
											</div>
											<div class="details-more">
												<button class="btn-details-more btn-square" type="button">
													<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
													</svg>
												</button>
											</div>
										</div>
									</div>
									<div class="moreInfo">
										<div class="moreInfo-item">
											<div class="moreInfo-content">
												<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
											</div>
											<div class="moreInfo-content">
												<ul class="moreInfo-content-items">
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
															<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
															<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
															<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
															<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
															<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
															<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
														</svg>
														Напомнить: за 1 час
													</li>
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
															<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
															<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
															<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
															<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
															<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
														</svg>
														Повтор: Пн, ср. пт
													</li>
												</ul>
											</div>
										</div>
									</div>
								</div>
								<div class="details-item">
									<div class="details-item-main">
										<div class="details-content">
											<input type="checkbox" class="remind-select" checked />
											<div class="details-title">
												<h2 class="details-content-title inactive">Выпить Валидол</h2>
												<span class="details-time text__xs">15.06.2022, 10:00</span>
											</div>
										</div>
										<div class="details-content">
											<div class="details-edit">
												<button class="btn-details-edit btn-square" type="button">
													<span></span>
													<span></span>
													<span></span>
												</button>
												<ul class="details-edit-list hidden">
													<li>
														<a class="btn-edit-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M13.1252 16.1948H0.878447C0.646443 16.1948 0.423942 16.2899 0.259891 16.4592C0.0958398 16.6284 0.00367662 16.858 0.00367662 17.0974C0.00367662 17.3368 0.0958398 17.5664 0.259891 17.7356C0.423942 17.9049 0.646443 18 0.878447 18H13.1252C13.3572 18 13.5797 17.9049 13.7438 17.7356C13.9078 17.5664 14 17.3368 14 17.0974C14 16.858 13.9078 16.6284 13.7438 16.4592C13.5797 16.2899 13.3572 16.1948 13.1252 16.1948ZM0.878447 14.3896H0.957176L4.60497 14.0466C5.00456 14.0055 5.37829 13.8238 5.66344 13.5321L13.5364 5.40864C13.8419 5.07554 14.0071 4.63105 13.9956 4.17255C13.9841 3.71405 13.797 3.27894 13.4751 2.96257L11.0783 0.48943C10.7654 0.186241 10.3555 0.012275 9.92648 0.000625288C9.49745 -0.0110245 9.07922 0.140455 8.75138 0.426248L0.878447 8.54971C0.595691 8.84393 0.419634 9.22955 0.379828 9.64186L0.00367662 13.4057C-0.00810745 13.5379 0.00851788 13.6712 0.0523674 13.796C0.0962169 13.9208 0.166211 14.0341 0.25736 14.1278C0.339099 14.2115 0.436037 14.2777 0.542617 14.3226C0.649197 14.3675 0.763321 14.3903 0.878447 14.3896ZM9.86234 1.75308L12.2505 4.2172L10.5009 5.97728L8.15653 3.55829L9.86234 1.75308Z" fill="#5B6373" />
																</svg>
															</div>
															Редактировать
														</a>
													</li>
													<li>
														<a class="btn-delete-item btn-details-item" type="button">
															<div class="btn-square">
																<svg width="16" height="20" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
																	<path d="M8.00021 0.5C8.8777 0.499967 9.72101 0.838073 10.3528 1.44322C10.9846 2.04836 11.3557 2.8734 11.388 3.74482L11.3901 3.86933L15.0512 3.86879C15.2961 3.8689 15.5315 3.96307 15.7082 4.13162C15.8848 4.30017 15.9891 4.53005 15.9992 4.77321C16.0093 5.01638 15.9244 5.25401 15.7623 5.43643C15.6002 5.61885 15.3734 5.73195 15.1294 5.75208L15.0512 5.75532H14.4183L13.5358 17.3817C13.492 17.9578 13.2309 18.4961 12.8046 18.8889C12.3784 19.2817 11.8185 19.5 11.2372 19.5H4.76325C4.18192 19.5 3.62206 19.2817 3.1958 18.8889C2.76955 18.4961 2.50838 17.9578 2.46461 17.3817L1.5816 5.75532H0.949178C0.710881 5.7553 0.481309 5.6662 0.306065 5.50573C0.130821 5.34526 0.0227264 5.12515 0.00325409 4.88913L0 4.81206C2.01046e-05 4.57524 0.0896736 4.3471 0.251151 4.17295C0.412629 3.9988 0.634116 3.89138 0.871617 3.87203L0.949178 3.86879H4.61029C4.61029 2.09115 5.99609 0.634752 7.75288 0.508624L7.87601 0.502156L8.00021 0.5ZM10.0342 7.50709C9.86632 7.50702 9.70441 7.56882 9.57977 7.68053C9.45513 7.79225 9.37662 7.94593 9.35944 8.11186L9.35618 8.18085V14.6489L9.35944 14.7179C9.37591 14.8844 9.45411 15.0388 9.57882 15.1512C9.70353 15.2635 9.86584 15.3258 10.0342 15.3258C10.2025 15.3258 10.3648 15.2635 10.4895 15.1512C10.6142 15.0388 10.6924 14.8844 10.7089 14.7179L10.7121 14.6489V8.18085L10.7089 8.11186C10.6917 7.94593 10.6132 7.79225 10.4886 7.68053C10.3639 7.56882 10.202 7.50702 10.0342 7.50709ZM5.96626 7.50709C5.79841 7.50702 5.63651 7.56882 5.51187 7.68053C5.38723 7.79225 5.30872 7.94593 5.29153 8.11186L5.28828 8.18085V14.6489L5.29153 14.7179C5.308 14.8844 5.3862 15.0388 5.51092 15.1512C5.63563 15.2635 5.79794 15.3258 5.96626 15.3258C6.13459 15.3258 6.29689 15.2635 6.42161 15.1512C6.54632 15.0388 6.62452 14.8844 6.64099 14.7179L6.64425 14.6489V8.18085L6.64099 8.11186C6.6238 7.94593 6.54529 7.79225 6.42065 7.68053C6.29601 7.56882 6.13411 7.50702 5.96626 7.50709ZM8.09133 2.38922L8.00021 2.38652C7.62039 2.38651 7.25486 2.53049 6.97819 2.78911C6.70153 3.04772 6.53456 3.40149 6.51136 3.77824L6.50865 3.86933L9.49178 3.86879C9.4918 3.49133 9.34691 3.12809 9.08667 2.85314C8.82644 2.5782 8.47045 2.41228 8.09133 2.38922Z" fill="#5B6373" />
																</svg>
															</div>
															Удалить
														</a>
													</li>
												</ul>
											</div>
											<div class="details-more">
												<button class="btn-details-more btn-square" type="button">
													<svg width="12" height="7" viewBox="0 0 12 7" fill="none" xmlns="http://www.w3.org/2000/svg">
														<path d="M1 1L6 6L11 1" stroke="#5B6373" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" />
													</svg>
												</button>
											</div>
										</div>
									</div>
									<div class="moreInfo">
										<div class="moreInfo-item">
											<div class="moreInfo-content">
												<span class="text__xs">Валакордин, Витамин D, Валидол, Тромбопол, Валерьянка</span>
											</div>
											<div class="moreInfo-content">
												<ul class="moreInfo-content-items">
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M13.2783 4.36023C13.2783 5.07069 12.7013 5.64698 12.0005 5.64698C11.2996 5.64698 10.7227 5.07069 10.7227 4.36023V1.78674C10.7227 1.07565 11.2996 0.5 12.0005 0.5C12.7013 0.5 13.2783 1.07565 13.2783 1.78674V4.36023Z" fill="#FFCC4D" />
															<path d="M6.36655 23.4997C6.22344 23.4997 6.07777 23.4665 5.94104 23.3981C5.71427 23.2814 5.54248 23.0802 5.46275 22.8379C5.38303 22.5956 5.40176 22.3317 5.5149 22.1031L11.2267 10.5218C11.3877 10.1946 11.7173 9.98828 12.0783 9.98828C12.4393 9.98828 12.769 10.1946 12.93 10.5218L18.6424 22.1031C18.7557 22.3316 18.7746 22.5955 18.695 22.8378C18.6154 23.0801 18.4437 23.2814 18.2169 23.3981C18.1048 23.4545 17.9827 23.4881 17.8575 23.4969C17.7324 23.5056 17.6068 23.4895 17.488 23.4493C17.3691 23.4091 17.2595 23.3457 17.1654 23.2628C17.0712 23.1799 16.9945 23.0791 16.9397 22.9663L12.079 13.1112L7.21884 22.9663C7.14073 23.1259 7.0195 23.2604 6.86888 23.3547C6.71825 23.449 6.54425 23.4992 6.36655 23.4997Z" fill="#FFAC33" />
															<path d="M12.0743 13.5283C11.9908 13.5283 11.9081 13.5116 11.8311 13.4792C11.7541 13.4468 11.6843 13.3995 11.6258 13.3399L2.74061 4.33202C2.49271 4.08029 2.49271 3.67331 2.74061 3.42223C2.9885 3.17114 3.39037 3.17114 3.63762 3.42223L12.0743 11.9745L20.5097 3.42159C20.5683 3.36199 20.6381 3.31466 20.7152 3.28235C20.7922 3.25004 20.875 3.2334 20.9585 3.2334C21.0421 3.2334 21.1248 3.25004 21.2019 3.28235C21.2789 3.31466 21.3488 3.36199 21.4073 3.42159C21.5264 3.54305 21.5931 3.70638 21.5931 3.87648C21.5931 4.04659 21.5264 4.20992 21.4073 4.33138L12.5234 13.3399C12.4647 13.3994 12.3948 13.4466 12.3177 13.479C12.2406 13.5113 12.1579 13.5281 12.0743 13.5283Z" fill="#58595B" />
															<path d="M22.2306 12.8854C22.2306 18.5703 17.6848 23.1787 12.0759 23.1787C6.46829 23.1787 1.92188 18.5703 1.92188 12.8854C1.92188 7.19921 6.46829 2.59082 12.0759 2.59082C17.6842 2.59018 22.2306 7.19921 22.2306 12.8854Z" fill="#E71E5A" />
															<path d="M19.6917 12.8852C19.6917 17.1492 16.2831 20.6056 12.076 20.6056C7.87011 20.6056 4.46094 17.1492 4.46094 12.8852C4.46094 8.62051 7.87011 5.16406 12.076 5.16406C16.2831 5.16342 19.6917 8.62051 19.6917 12.8852Z" fill="#E6E7E8" />
															<path d="M19.6926 1.30273C19.1911 1.30265 18.6947 1.40263 18.2324 1.59681C17.7701 1.79099 17.3512 2.07547 17.0002 2.43359L22.3855 7.89235C23.1023 7.16504 23.503 6.18414 23.5004 5.16297C23.5004 3.0316 21.7952 1.30273 19.6926 1.30273ZM4.30786 1.30273C4.80928 1.30269 5.30567 1.40268 5.76797 1.59686C6.23027 1.79104 6.64918 2.0755 7.00018 2.43359L1.61489 7.89235C0.898088 7.16504 0.497416 6.18414 0.500013 5.16297C0.500013 3.0316 2.2046 1.30273 4.30786 1.30273Z" fill="#FFCC4D" />
															<path d="M15.1928 13.2779H11.9983C11.8288 13.2779 11.6663 13.2106 11.5465 13.0908C11.4267 12.971 11.3594 12.8084 11.3594 12.639V6.8889C11.3594 6.71945 11.4267 6.55695 11.5465 6.43713C11.6663 6.31731 11.8288 6.25 11.9983 6.25C12.1677 6.25 12.3302 6.31731 12.45 6.43713C12.5699 6.55695 12.6372 6.71945 12.6372 6.8889V12.0001H15.1928C15.3622 12.0001 15.5247 12.0674 15.6445 12.1872C15.7644 12.307 15.8317 12.4696 15.8317 12.639C15.8317 12.8084 15.7644 12.971 15.6445 13.0908C15.5247 13.2106 15.3622 13.2779 15.1928 13.2779Z" fill="#414042" />
														</svg>
														Напомнить: за 1 час
													</li>
													<li>
														<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
															<path d="M0.792969 21.141V6.98718H23.2032V21.141C23.2032 22.4385 22.1417 23.5 20.8443 23.5H3.15194C1.85451 23.5 0.792969 22.4385 0.792969 21.141Z" fill="#CFD8DC" />
															<path d="M23.2032 4.62851V8.16697H0.792969V4.62851C0.792969 3.33107 1.85451 2.26953 3.15194 2.26953H20.8443C22.1417 2.26953 23.2032 3.33107 23.2032 4.62851Z" fill="#4065AE" />
															<path d="M17.3044 6.39686C18.2815 6.39686 19.0736 5.60475 19.0736 4.62763C19.0736 3.65051 18.2815 2.8584 17.3044 2.8584C16.3273 2.8584 15.5352 3.65051 15.5352 4.62763C15.5352 5.60475 16.3273 6.39686 17.3044 6.39686Z" fill="#304E8A" />
															<path d="M6.6872 6.39686C7.66432 6.39686 8.45643 5.60475 8.45643 4.62763C8.45643 3.65051 7.66432 2.8584 6.6872 2.8584C5.71008 2.8584 4.91797 3.65051 4.91797 4.62763C4.91797 5.60475 5.71008 6.39686 6.6872 6.39686Z" fill="#304E8A" />
															<path d="M17.3066 0.5C16.6579 0.5 16.1271 1.03077 16.1271 1.67949V4.62821C16.1271 5.27692 16.6579 5.80769 17.3066 5.80769C17.9553 5.80769 18.4861 5.27692 18.4861 4.62821V1.67949C18.4861 1.03077 17.9553 0.5 17.3066 0.5ZM6.69121 0.5C6.04249 0.5 5.51172 1.03077 5.51172 1.67949V4.62821C5.51172 5.27692 6.04249 5.80769 6.69121 5.80769C7.33992 5.80769 7.87069 5.27692 7.87069 4.62821V1.67949C7.87069 1.03077 7.33992 0.5 6.69121 0.5Z" fill="#B0BEC5" />
															<path d="M15.7822 12.3389C15.782 12.3057 15.7728 12.2733 15.7556 12.2451C15.7384 12.2168 15.7138 12.1939 15.6846 12.1788C15.6554 12.1637 15.6227 12.157 15.59 12.1595C15.5573 12.1619 15.5259 12.1734 15.4992 12.1926L14.7408 12.7426C13.9833 11.9782 12.9436 11.5 11.7914 11.5C10.2203 11.5 8.84902 12.3796 8.13194 13.6769L8.13477 13.6785C8.10302 13.7473 8.09789 13.8256 8.12039 13.898C8.14289 13.9705 8.1914 14.0318 8.25636 14.0698L9.21861 14.6316C9.25287 14.6516 9.2907 14.6647 9.32993 14.6699C9.36916 14.6751 9.40903 14.6725 9.44725 14.6621C9.48548 14.6518 9.52131 14.6339 9.5527 14.6096C9.58409 14.5852 9.61043 14.5548 9.6302 14.5201C9.63091 14.5188 9.63126 14.5174 9.63197 14.5161C10.0567 13.7501 10.8665 13.2307 11.795 13.2307C12.3721 13.2307 12.9011 13.4335 13.3224 13.7689L13.204 13.8549L12.5005 14.3647C12.474 14.3841 12.4532 14.4105 12.4405 14.441C12.4277 14.4716 12.4236 14.5051 12.4284 14.5379C12.4333 14.5707 12.4469 14.6015 12.4679 14.6269C12.4889 14.6524 12.5165 14.6715 12.5475 14.6822L15.5571 15.7191C15.584 15.7283 15.6127 15.7308 15.6408 15.7266C15.6689 15.7224 15.6955 15.7114 15.7186 15.6946C15.7417 15.6779 15.7604 15.6558 15.7734 15.6302C15.7863 15.6047 15.793 15.5764 15.793 15.5477L15.7822 12.3389ZM15.3298 16.9303L14.3673 16.3684C14.3331 16.3484 14.2952 16.3353 14.256 16.3301C14.2168 16.3249 14.1769 16.3275 14.1387 16.3379C14.1005 16.3482 14.0646 16.3661 14.0332 16.3904C14.0018 16.4148 13.9755 16.4452 13.9557 16.4799C13.955 16.4812 13.9547 16.4826 13.954 16.4839C13.5293 17.2499 12.7194 17.7693 11.7909 17.7693C11.2139 17.7693 10.6848 17.5665 10.2635 17.2311L10.3819 17.1451L11.0854 16.6353C11.112 16.6159 11.1328 16.5895 11.1455 16.559C11.1582 16.5284 11.1624 16.4949 11.1575 16.4621C11.1527 16.4293 11.139 16.3985 11.118 16.3731C11.097 16.3476 11.0695 16.3285 11.0385 16.3178L8.0288 15.2809C8.00191 15.2717 7.97323 15.2692 7.94515 15.2734C7.91707 15.2776 7.89039 15.2886 7.86734 15.3054C7.84428 15.3221 7.82551 15.3442 7.81257 15.3698C7.79964 15.3953 7.79292 15.4236 7.79297 15.4523L7.80385 18.6611C7.80406 18.6943 7.81327 18.7267 7.83047 18.7549C7.84768 18.7832 7.87222 18.8061 7.90142 18.8212C7.93062 18.8363 7.96336 18.843 7.99606 18.8405C8.02876 18.8381 8.06017 18.8266 8.08687 18.8074L8.84523 18.2574C9.60276 19.0218 10.6425 19.5 11.7947 19.5C13.3658 19.5 14.737 18.6204 15.4541 17.3231L15.4512 17.3216C15.4829 17.2529 15.4881 17.1746 15.4656 17.1021C15.4432 17.0297 15.3947 16.9684 15.3298 16.9303Z" fill="#4065AE" />
														</svg>
														Повтор: Пн, ср. пт
													</li>
												</ul>
											</div>
										</div>
									</div>
								</div>
							</div>
						</div>
					</div>
				</div>
			</div>
		</section>
		<!-- END REMINDER -->
		<!-- DIAGRAM -->
		<section class="diary-main diagram">
			<div class="sort-container">
				<h1>Динамика</h1>
				<div class="sort-main">
					<div class="sort-item sort-period">
						<span class="text__xs">Показать</span>
						<button class="btn-select text__xs btnSelect" id="btn_select" type="button">
							Весь период
							<svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 1L5 5L1 0.999999" stroke="#333638" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
							</svg>
						</button>
						<div class="select-list hidden">
							<div class="select-group">
								<div class="input-group">
									<input type="radio" name="periodSort" id="all_2" />
									<input type="radio" name="periodSort" id="today_2" />
									<input type="radio" name="periodSort" id="week_2" />
									<input type="radio" name="periodSort" id="month_2" />
									<input type="radio" name="periodSort" id="year_2" />
								</div>
								<div class="label-group">
									<label for="all_2">Весь период</label>
									<label for="today_2">Сегодня</label>
									<label for="week_2">За неделю</label>
									<label for="month_2">За месяц</label>
									<label for="year_2">За год</label>
								</div>
							</div>
							<button class="btn-select-show" type="button">
								Показать
								<svg width="21" height="13" viewBox="0 0 21 13" fill="none" xmlns="http://www.w3.org/2000/svg">
									<path opacity="0.9" d="M20.5303 7.03033C20.8232 6.73744 20.8232 6.26256 20.5303 5.96967L15.7574 1.1967C15.4645 0.903807 14.9896 0.903807 14.6967 1.1967C14.4038 1.48959 14.4038 1.96447 14.6967 2.25736L18.9393 6.5L14.6967 10.7426C14.4038 11.0355 14.4038 11.5104 14.6967 11.8033C14.9896 12.0962 15.4645 12.0962 15.7574 11.8033L20.5303 7.03033ZM-6.55671e-08 7.25L20 7.25L20 5.75L6.55671e-08 5.75L-6.55671e-08 7.25Z" fill="#BAC0CB" />
								</svg>
							</button>
						</div>
					</div>
					<div class="sort-item">
						<span class="text__xs">Поиск по дате</span>
						<div class="calendar-item">
							<input class="input-calendar text__xs range-calendar" type="date" placeholder="Выберите период" />
							<svg width="10" height="6" viewBox="0 0 10 6" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M9 1L5 5L1 0.999999" stroke="#333638" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
							</svg>
						</div>
					</div>
				</div>
				<div class="sort-main-mobile">
					<button class="btn-square-shadow sort-filter">
						<svg width="26" height="24" viewBox="0 0 26 24" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M24.5 2H2.5V5.17L9.91 12.59L10.5 13.17V22H14.5V20H16.5V22C16.5 22.5304 16.2893 23.0391 15.9142 23.4142C15.5391 23.7893 15.0304 24 14.5 24H10.5C9.96957 24 9.46086 23.7893 9.08579 23.4142C8.71072 23.0391 8.5 22.5304 8.5 22V14L1.09 6.59C0.902832 6.40394 0.754338 6.18268 0.653078 5.93897C0.551817 5.69526 0.499792 5.43391 0.500001 5.17V2C0.500001 1.46957 0.710714 0.960859 1.08579 0.585786C1.46086 0.210714 1.96957 0 2.5 0H24.5V2Z" fill="#4065AE" />
							<path d="M24.5 17L22.1389 14.6347L24.5 17ZM23.4474 11.4737C23.4474 12.6602 22.976 13.7981 22.1371 14.6371C21.2981 15.476 20.1602 15.9474 18.9737 15.9474C17.7872 15.9474 16.6493 15.476 15.8103 14.6371C14.9713 13.7981 14.5 12.6602 14.5 11.4737C14.5 10.2872 14.9713 9.14929 15.8103 8.31031C16.6493 7.47133 17.7872 7 18.9737 7C20.1602 7 21.2981 7.47133 22.1371 8.31031C22.976 9.14929 23.4474 10.2872 23.4474 11.4737V11.4737Z" stroke="#4065AE" stroke-width="2" stroke-linecap="round" />
						</svg>
					</button>
				</div>
			</div>
			<div class="diary-container">
				<div class="diagram-container">
					<canvas id="diagram"></canvas>
				</div>
			</div>
		</section>
		<!-- END DIAGRAM -->
	</div>
</template>

<script>
import ForzeModal from '~/components/parts/Modals/ForzeModal.vue';
export default { components: { ForzeModal } }
</script>

<style></style>
